Помощь_студентам/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Макс_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Макс_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Макс_ПроцентСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Помощь_студентам/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// М.В. Катеринич, 23.05.2023 Программное добавление элементов на форму {	 
	ПрограммноеДобавлениеЭлементовНаФорму(); 
	// М.В. Катеринич, 23.05.2023 18:51:03  }
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//М.В. Катеринич 29.05.2023 удаление прошлого рассчета { 
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	//М.В. Катеринич 29.05.2023 удаление прошлого рассчета }
	
	// М.В. Катеринич, 25.05.2023 добавление к рассчету % скидки/наценки {  
	ТекущиеДанные.Сумма = ПересчитатьСумму (ТекущиеДанные.Количество, ТекущиеДанные.Цена, Объект.Макс_ПроцентСкидкиНаценки, ТекущиеДанные.Скидка); 
	// М.В. Катеринич, 25.05.2023 добавление к рассчету % скидки/наценки }  
	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти   

#Область Макс_ДоработкаФормы    

// М.В. Катеринич, 24.05.2023 19:53:34 {  

&НаСервере
Процедура ПрограммноеДобавлениеЭлементовНаФорму() 
	
	//М.В. Катеринич Добавление команды пересчета суммы {
	НоваяКоманда = Команды.Добавить("ПересчитатьСуммуСУчетомСкидкиНаценки"); 
	НоваяКоманда.Заголовок = "Пересчитать с учетом скидки?"; 
	НоваяКоманда.Действие ="ПересчитатьСуммуСУчетомСкидкиНаценки"; 
	Кнопка = Элементы.Вставить("КнопкаРассчитатьСоСкидкой",Тип("КнопкаФормы"), Элементы.ГруппаШапкаЛево); 
	Кнопка.ИмяКоманды = "ПересчитатьСуммуСУчетомСкидкиНаценки";    
	Кнопка.ЦветФона = Новый Цвет(255, 255, 153);
	Кнопка.Шрифт = Новый Шрифт(, 12, Истина, , , );      
	//М.В. Катеринич Добавление команды пересчета суммы }
	
КонецПроцедуры       

&НаКлиенте
Процедура  Макс_ПроцентСкидкиНаценкиПриИзменении (Элемент)  
	
	ДиалоговоеОкноДаНет(); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПересчитатьСуммуСУчетомСкидкиНаценки(Команда)  
	
	ДиалоговоеОкноДаНет(); 

КонецПроцедуры   

&НаКлиенте
Процедура ДиалоговоеОкноДаНет()
	
	//М.В. Катеринич Диалоговое окно "Да/нет" {
	Режим = РежимДиалогаВопрос.ДаНет; 
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект, Параметры); 
	ПоказатьВопрос(Оповещение, "Пересчитать с учетом скидки/наценки?", Режим, 0); 
	//М.В. Катеринич Диалоговое окно "Да/нет" }
	
КонецПроцедуры	


&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт     
	
	//М.В. Катеринич пересчет строк после ответа на вопрос {
	Если Результат = КодВозвратаДиалога.Да Тогда    
		
		Для каждого ТекТовар Из Объект.Товары Цикл
			
			ТекТовар.Сумма =   ПересчитатьСумму (ТекТовар.Количество, ТекТовар.Цена, Объект.Макс_ПроцентСкидкиНаценки, ТекТовар.Скидка); 
			
		КонецЦикла;   
		
		Для каждого ТекУслуга Из Объект.Услуги Цикл
			
			ТекУслуга.Сумма =   ПересчитатьСумму (ТекУслуга.Количество, ТекУслуга.Цена, Объект.Макс_ПроцентСкидкиНаценки, ТекУслуга.Скидка); 
			
		КонецЦикла;   
		
		Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
		
	КонецЕсли;
	//М.В. Катеринич пересчет строк после ответа на вопрос }
	
КонецПроцедуры     

&НаКлиенте
Функция ПересчитатьСумму (Количество, Цена, СкидкаНаценка, Скидка) 
	
	//М.В. Катеринич Изменение суммы на % скидки/наценки {
	//Изменение суммы на % скидки/наценки 
	//Наценка: плюсовое значение
	//Скидка: минусовое значение     
	
	ОбщаяСкидка = СкидкаНаценка + Скидка;  
	Доля = СкидкаНаценка/100;   
	ДоляТек = Скидка/100;
	ОбщаяДоля = Доля + ДоляТек; 
	Коэфициент = 1 - ОбщаяДоля;  

	Если ОбщаяСкидка > 100 Тогда
		Сумма = 0; 
		Сообщить  ("Суммарная скидка не может быть больше 100%!");   
	Иначе
	    Сумма = Количество * Цена * Коэфициент;  
    КонецЕсли; 
			
	Возврат  Сумма; 
	
	//М.В. Катеринич Изменение суммы на % скидки/наценки }
	
КонецФункции  

// М.В. Катеринич, 24.05.2023 19:53:34  }

#КонецОбласти
